Repository: BradleyBao/Cipherflow
Catalog: DataLock/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppName.Text
source: Cipherflow
zh_cn: 密流

# SetupAppPassword
source: Enter your password
zh_cn: 输入密码

# HomePage_Configure_Setting_Btn.Content
source: Configure
zh_cn: 配置

# Homepage_Crypt_Title.Text
source: Cryptography Page
zh_cn: 密码学

# Homepage_Decrypt_Title.Description
source: Encrypt files using various algorithms.
zh_cn: 使用各种算法加密

# Homepage_Decrypt_Title.Header
source: Decryption Page
zh_cn: 解密

# Homepage_Encrypt_Title.Description
source: Decrypt files using various algorithms.
zh_cn: 使用各种算法解密

# Homepage_Encrypt_Title.Header
source: Encryption Page
zh_cn: 加密

# Homepage_Security_Status_Moderate
source: Moderate security settings.
zh_cn: 安全设置中等

# Homepage_Security_Status_Safe
source: Strong security settings.
zh_cn: 安全设置强

# Homepage_Security_Status_Severe
source: Weak security settings.
zh_cn: 安全设置弱

# Homepage_Security_Title.Text
source: Security Setting
zh_cn: 安全设置

# NavCryptography.Content
source: Cryptography
zh_cn: 密码学

# NavDecrypt.Content
source: Decrypt
zh_cn: 解密页

# NavDIY.Content
source: DIY
zh_cn: 自定义页

# NavEncrypt.Content
source: Encrypt
zh_cn: 加密页

# NavHomepage.Content
source: Home
zh_cn: 主页

# SettingPage_Dispay_Langauge_Title.Description
source: Choose the display language.
zh_cn: 选择显示语言

# SettingPage_Dispay_Langauge_Title.Header
source: App Language
zh_cn: 应用语言

# SettingPage_General_Title.Text
source: General
zh_cn: 通用设置

# SettingPage_MFA_Title.Description
source: Setup Multi-factor authentication.
zh_cn: 设置多重要素验证

# SettingPage_MFA_Title.Header
source: MFA
zh_cn: 多重要素验证

# SettingPage_Security_Title.Text
source: Security
zh_cn: 安全设置

# SettingPage_Software_Password_Title.Description
source: Setup password for this software.
zh_cn: 设置密码

# SettingPage_Software_Password_Title.Header
source: Password
zh_cn: 密码

# SettingPage_Windows_Hello_Title.Description
source: Use Windows Hello (Pin, Fingerprint, Face Recognition) as MFA.
zh_cn: 使用内置Windows Hello作为多重要素验证

# SettingPage_Windows_Hello_Title.Header
source: Windows Hello
zh_cn: Windows Hello 验证

# WelcomeText
source: Hello
zh_cn: 欢迎

# DialogOK
source: OK
zh_cn: 确认

# DialogCancel
source: Cancel
zh_cn: 取消

# SetPasswordBtn.Content
source: Set
zh_cn: 设置

# SetPassword
source: Set
zh_cn: 设置密码

# UnsetPassword
source: Unset
zh_cn: 取消设置

# UnsetPasswordError_WrongPassword
source: Wrong Password
zh_cn: 密码错误

source: Language Changed
zh_cn: 更改语言

# RestartRequireMsg
source: Restarting the software is required.
zh_cn: 需要重启应用

# SettingPage_Title.Text
source: Settings
zh_cn: 设置

# SettingPage_About_Title.Text
source: About
zh_cn: 关于

# EncryptPage_Title.Text
source: Encrypt
zh_cn: 加密

# EncryptPage_Upload_Des.Text
source: Drag and drop to add files/folders
zh_cn: 拖拽来添加文件或文件夹

# EncryptPage_Upload_Des_Long.Text
source: Drag files from File Explorer or your desktop and drop them here to add files to the encryption list.
zh_cn: 从文件资源管理器或桌面拖动文件并将其放置在此处以添加到加密列表中。

# BrowseAndAllFilesBtn_Btn.Content
source: Browse and add files
zh_cn: 浏览并添加文件

# encryptMethodSettingsCardUid.Header
source: Encription Method
zh_cn: 加密方式

# encryptMethodSettingsCardUid.Description
source: Choose the preferred encription method.
zh_cn: 选择偏好加密算法

# encryptSavePathSettingsCardUid.Header
source: Save in target folder
zh_cn: 在目标文件夹保存

# encryptSavePathSettingsCardUid.Description
source: Choose the folder that will save the files.
zh_cn: 选择保存文件的文件夹

# SavePathSettingCardUid.Header
source: Choose Save Path
zh_cn: 选择保存路径

# EncryptPage_ThisDeviceOnly_Uid.Header
source: This device only
zh_cn: 仅限此设备

# EncryptPage_ThisDeviceOnly_Uid.Description
source: This file can only decrypt in this deivce.
zh_cn: 文件只能在此设备解密

# KeepOriginalFilesSettingCardUID.Header
source: Keep original files
zh_cn: 保留原始文件

# KeepOriginalFilesSettingCardUID.Description
source: Selecting this option would make a copy of encrypted target files.
zh_cn: 选择该选项将复制加密的目标文件。

# EncryptPage_PasswordSettingCard_Uid.Header
source: Password
zh_cn: 密码

# EncryptPage_PasswordSettingCard_Uid.Description
source: Set Password for all files
zh_cn: 为所有文件设置密码

# EncryptPage_FilePsdBox_PsdBox.PlaceholderText
source: Enter your password
zh_cn: 输入用于加密的密码

# EncryptRun_Btn.Content
source: Execute
zh_cn: 执行

# SelectedEncryptFilesTitle.Text
source: Selected Files:
zh_cn: 已选择文件：

# DecryptPage_Title.Text
source: Decrypt
zh_cn: 解密

# DecryptPage_Upload_Des.Text
source: Drag and drop to add files/folders
zh_cn: 拖拽来添加文件或文件夹

# DecryptPage_Upload_Des_Long.Text
source: Drag files from File Explorer or your desktop and drop them here to add files to the encryption list.
zh_cn: 从文件资源管理器或桌面拖动文件并将其放置在此处以添加到加密列表中。

# decryptMethodSettingsCardUid.Header
source: Decription Method
zh_cn: 解密方式

# decryptMethodSettingsCardUid.Description
source: Choose the preferred decription method.
zh_cn: 选择偏好解密算法

# DeBrowseAndAllFilesBtn_Btn.Content
source: Browse and add files
zh_cn: 浏览并添加文件

# decryptSavePathSettingsCardUid.Header
source: Save in target folder
zh_cn: 在目标文件夹保存

# decryptSavePathSettingsCardUid.Description
source: Choose the folder that will save the files.
zh_cn: 选择保存文件的文件夹

# DecryptPage_PasswordSettingCard_Uid.Header
source: Password
zh_cn: 密码

# DecryptPage_PasswordSettingCard_Uid.Description
source: Enter Password for encrypted files
zh_cn: 为加密文件输入密码

# DecryptPage_FilePsdBox_PsdBox.PlaceholderText
source: Enter your password
zh_cn: 输入用于解密的密码

# SelectedDecryptFilesTitle.Text
source: Selected Files:
zh_cn: 已选择文件：

# DecryptRun_Btn.Content
source: Execute
zh_cn: 执行

# SettingSevere
source: Security settings are not configured
zh_cn: 尚未完成安全设置

# SettingModerate
source: Some security settings are not configured
zh_cn: 一些安全设置尚未被配置

# SettingSafe
source: Security settings have been properly configured
zh_cn: 安全设置已完善

# UnderDevelopmentTitle
source: Under Development
zh_cn: 仍在开发

# UnderDevelopmentContent
source: Some functions are still under development.
zh_cn: 一些功能仍在开发中

# EncryptionCompleteDialogTitle
source: Encryption Complete
zh_cn: 加密完成

# EncryptionCompleteDialogContent
source: file(s) have been encrypted.
zh_cn: 个文件已被加密

source: Open Folder?
zh_cn: 是否打开文件夹？

# DecryptionCompleteDialogTitle
source: Decryption Complete
zh_cn: 解密完成

# DecryptionErrorTimeContent
source: files failed to decrypt.
zh_cn: 个文件无法解密

# DecryptionCompleteDialogContent
source: file(s) have been decrypted.
zh_cn: 个文件已被解密

# AES_GCM_Des_Header
source: About AES-GCM
zh_cn: 什么是AES-GCM

# AES_GCM_Des_Des
source: Learn more about AES-GCM Algorithm
zh_cn: 了解更多关于AES-GCM算法

# ChaCha20_Des_Header
source: About ChaCha20-Poly1305
zh_cn: 什么是ChaCha20-Poly1305

# ChaCha20_Des_Des
source: Learn more about ChaCha20-Poly1305 Algorithm
zh_cn: 了解跟多关于ChaCha20-Poly1305算法

# ChaCha20_Des_Link
source: https://en.wikipedia.org/wiki/ChaCha20-Poly1305
zh_cn: https://zh.wikipedia.org/wiki/ChaCha20-Poly1305

# AES_GCM_Des_Link
source: https://en.wikipedia.org/wiki/Advanced_Encryption_Standard
zh_cn: https://zh.wikipedia.org/wiki/%E9%AB%98%E7%BA%A7%E5%8A%A0%E5%AF%86%E6%A0%87%E5%87%86

# WindowsHelloVerify
source: Please verify your identity using Windows Hello.
zh_cn: 需要确认您的身份

# WindowsHelloSetupSuccess
source: Windows Hello is set up successfully.
zh_cn: 成功设置

# WindowsHelloSetupFailed
source: Windows Hello authentication failed.
zh_cn: 设置失败

# WindowsHelloAlreadySet
source: Windows Hello has been set.
zh_cn: 已设置

# WindowsHelloNotSet
source: Windows Hello has not been set.
zh_cn: 尚未设置

# VerifyFailedTitle
source: Authentication Failed
zh_cn: 验证失败

# VerifyFailedPsdMsg
source: Incorrect Password: Software Lockdown.
zh_cn: 密码错误：软件锁定

# VerifyFailedWindowsHelloMsg
source: Failed to pass Windows Hello Authentication: Software Lockdown
zh_cn: Windows Hello 验证错误：软件锁定

# EncryptPage_LoopFolder_Uid.Header
source: Encrypt Files in Folder
zh_cn: 加密文件夹中的文件

# EncryptPage_LoopFolder_Uid.Description
source: Encrypt Every Files inside the Folder.
zh_cn: 加密文件夹中所有文件和文件夹

# OpenFolderConfirm
source: Open Folder
zh_cn: 打开文件夹

# SettingPage_AppSetting_Title.Text
source: App Settings
zh_cn: 应用设置

# SettingPage_TempFolderPath_Title.Header
source: Temporary Files
zh_cn: 临时文件

# SetupTempFolderPathUid.Content
source: Set
zh_cn: 设置

# CancelButtonSetting
source: Unset
zh_cn: 取消设置

# SetButtonSetting
source: Set
zh_cn: 设置

# ChangeTempFolderHintTitle
source: Temp Folder
zh_cn: 临时文件存放

# ChangeTempFolderHintBody
source: It is strongly recommended to change the folder that stored temporary files.
zh_cn: 强烈建议更改存放临时文件的文件夹。

source: Access Denied
zh_cn: 无权访问

source: Path Too Long
zh_cn: 路径过长

# arg_except
source: Argument Error
zh_cn: 非法路径

# memory_except
source: Out of Memory
zh_cn: 内存不足

# IOError
source: File / Folder in use
zh_cn: 文件或文件夹正在被占用

# security_except
source: Operation blocked by Security Policy
zh_cn: 操作被安全策略阻止

# cleaning_cache_error
source: Failed to clear cache
zh_cn: 缓存清理失败

# cleaning_cache_error_descript
source: Failed to clear temp files or original files / folders.
zh_cn: 临时文件或原始目录删除失败

source: Directory Not Found
zh_cn: 文件夹不存在

# directory_not_found_des
source: Target Directory might had been deleted, moved, or renamed.
zh_cn: 目标文件夹可能已被删除、移动或重命名

# access_denied_des
source: Insufficient permissions to delete the file or folder
zh_cn: 没有足够的权限删除文件或文件夹

# path_too_long_des
source: Path Length surpasses system limitation.
zh_cn: 路径长度超过系统限制

# memory_except_des
source: Cannot process due to out of memory.
zh_cn: 由于内存不足无法处理文件

# encrypt_failed
source: Encryption Failed
zh_cn: 加密失败

# encrypt_failed_descript
source: Failed to encrypt the file or folder
zh_cn: 加密文件夹时出错

# error_list_title_del
source: Cannot Delete Temp / Originals
zh_cn: 无法删除临时文件或源文件

# error_list_title_enc
source: Cannot Encrypt Files / Folders
zh_cn: 无法加密以下文件或文件夹

source: Error
zh_cn: 错误

# unknown_algorithm_index
source: Unknown Algorithm
zh_cn: 未知的加密算法索引

source: File Camouflage
zh_cn: 文件伪装

# NavDisguise.Content
source: File Camouflage
zh_cn: 文件伪装

# NavDisguiseAsImg.Content
source: Disguise as JPG
zh_cn: 伪装成图片

# NavDisguiseAsImg.ToolTipService.ToolTip
source: Hide files in JPG image.
zh_cn: 将文件隐藏在图片

# NavDecrypt.ToolTipService.ToolTip
source: Converting ciphertext into plaintext.
zh_cn: 密文转明文

# NavEncrypt.ToolTipService.ToolTip
source: Converting plaintext into ciphertext.
zh_cn: 明文转密文

# SelectPictureTypeSetting.Header
source: Picture Type that disguise to
zh_cn: 选择伪装的图片格式

# SelectPictureTypeSetting.Description
source: The picture type that the files are going to disguise to.
zh_cn: 选择文件将要伪装的图片格式

# ChangePictureBtn.Content
source: Change Picture
zh_cn: 更改图片

# DisguisionPage_Upload_Des.Text
source: Drag and drop to add files
zh_cn: 拖放以添加文件

# DisguisionPage_Upload_Des_Long.Text
source: Drag files from File Explorer or your desktop and drop them here to add files to the disguision list.
zh_cn: 从文件资源管理器或桌面拖动文件并将其放置在此处以添加到伪装列表中。

# disguiseSavePathSettingsCardUid.Header
source: Save in target folder
zh_cn: 保存至目标文件夹

# disguiseSavePathSettingsCardUid.Description
source: Save the files into specified directory.
zh_cn: 将文件保存在一个特定的文件夹

# SavePathSettingCardUid.Description
source: Save Path would display here.
zh_cn: 选择的路径将会显示在这里

# ChooseSavePathFolderUid.Content
source: Choose Folder
zh_cn: 选择文件夹

# DisguiseRun_Btn.Content
source: Execute
zh_cn: 执行

# PrivateProtocolSetting.Header
source: Private Protocol
zh_cn: 私有协议

# PrivateProtocolSetting.Description
source: Only this software can open and convert this disguised file.
zh_cn: 只有这个软件才能打开并转换
